; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=282, out_folder=htg/blocksworld/training, instance_id=54, seed=2078, goal_proportion=0.03

(define (problem blocksworld-54)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 - object)
 (:init 
    (arm-empty)
    (clear b196)
    (on-table b196)
    (clear b167)
    (on b167 b250)
    (on b250 b176)
    (on b176 b153)
    (on-table b153)
    (clear b141)
    (on-table b141)
    (clear b126)
    (on b126 b225)
    (on b225 b78)
    (on b78 b164)
    (on-table b164)
    (clear b101)
    (on-table b101)
    (clear b202)
    (on b202 b88)
    (on b88 b107)
    (on b107 b84)
    (on-table b84)
    (clear b240)
    (on b240 b11)
    (on b11 b243)
    (on b243 b55)
    (on-table b55)
    (clear b112)
    (on b112 b115)
    (on b115 b162)
    (on b162 b199)
    (on b199 b37)
    (on b37 b99)
    (on-table b99)
    (clear b267)
    (on b267 b264)
    (on b264 b133)
    (on b133 b268)
    (on b268 b121)
    (on b121 b227)
    (on-table b227)
    (clear b212)
    (on b212 b27)
    (on b27 b151)
    (on b151 b271)
    (on-table b271)
    (clear b244)
    (on b244 b144)
    (on b144 b204)
    (on b204 b122)
    (on b122 b274)
    (on-table b274)
    (clear b275)
    (on b275 b203)
    (on b203 b46)
    (on b46 b7)
    (on b7 b93)
    (on-table b93)
    (clear b223)
    (on-table b223)
    (clear b106)
    (on b106 b256)
    (on b256 b231)
    (on b231 b277)
    (on b277 b67)
    (on b67 b49)
    (on b49 b34)
    (on b34 b179)
    (on b179 b111)
    (on b111 b219)
    (on b219 b45)
    (on b45 b43)
    (on b43 b136)
    (on b136 b20)
    (on b20 b105)
    (on b105 b148)
    (on b148 b273)
    (on b273 b57)
    (on b57 b226)
    (on b226 b65)
    (on-table b65)
    (clear b96)
    (on-table b96)
    (clear b92)
    (on-table b92)
    (clear b201)
    (on b201 b86)
    (on b86 b110)
    (on b110 b205)
    (on-table b205)
    (clear b137)
    (on b137 b169)
    (on-table b169)
    (clear b149)
    (on-table b149)
    (clear b56)
    (on-table b56)
    (clear b230)
    (on b230 b41)
    (on b41 b254)
    (on b254 b54)
    (on b54 b233)
    (on b233 b257)
    (on b257 b61)
    (on b61 b33)
    (on b33 b42)
    (on b42 b40)
    (on b40 b185)
    (on b185 b213)
    (on b213 b160)
    (on b160 b75)
    (on b75 b59)
    (on b59 b124)
    (on-table b124)
    (clear b155)
    (on b155 b237)
    (on-table b237)
    (clear b276)
    (on b276 b22)
    (on b22 b174)
    (on b174 b211)
    (on b211 b80)
    (on b80 b116)
    (on b116 b12)
    (on b12 b132)
    (on b132 b1)
    (on b1 b177)
    (on-table b177)
    (clear b39)
    (on b39 b253)
    (on b253 b127)
    (on-table b127)
    (clear b6)
    (on b6 b282)
    (on b282 b217)
    (on b217 b38)
    (on-table b38)
    (clear b98)
    (on b98 b113)
    (on b113 b263)
    (on b263 b102)
    (on-table b102)
    (clear b194)
    (on b194 b154)
    (on b154 b44)
    (on b44 b206)
    (on b206 b68)
    (on-table b68)
    (clear b279)
    (on b279 b90)
    (on b90 b74)
    (on b74 b4)
    (on b4 b189)
    (on-table b189)
    (clear b85)
    (on b85 b224)
    (on b224 b35)
    (on b35 b280)
    (on b280 b134)
    (on-table b134)
    (clear b157)
    (on b157 b239)
    (on b239 b18)
    (on b18 b8)
    (on-table b8)
    (clear b208)
    (on b208 b95)
    (on b95 b197)
    (on b197 b119)
    (on b119 b109)
    (on b109 b265)
    (on b265 b269)
    (on b269 b3)
    (on-table b3)
    (clear b200)
    (on-table b200)
    (clear b159)
    (on b159 b103)
    (on b103 b143)
    (on b143 b215)
    (on-table b215)
    (clear b19)
    (on b19 b72)
    (on b72 b36)
    (on b36 b262)
    (on b262 b2)
    (on b2 b234)
    (on b234 b26)
    (on b26 b58)
    (on b58 b142)
    (on b142 b50)
    (on-table b50)
    (clear b73)
    (on-table b73)
    (clear b60)
    (on b60 b17)
    (on-table b17)
    (clear b182)
    (on b182 b83)
    (on b83 b10)
    (on b10 b118)
    (on b118 b76)
    (on b76 b193)
    (on-table b193)
    (clear b51)
    (on b51 b131)
    (on b131 b81)
    (on-table b81)
    (clear b128)
    (on b128 b178)
    (on b178 b69)
    (on b69 b146)
    (on b146 b220)
    (on b220 b247)
    (on b247 b270)
    (on b270 b123)
    (on-table b123)
    (clear b195)
    (on b195 b255)
    (on b255 b31)
    (on b31 b13)
    (on b13 b152)
    (on b152 b272)
    (on b272 b251)
    (on b251 b228)
    (on b228 b29)
    (on b29 b66)
    (on b66 b187)
    (on b187 b156)
    (on b156 b218)
    (on b218 b114)
    (on-table b114)
    (clear b52)
    (on b52 b260)
    (on b260 b238)
    (on-table b238)
    (clear b281)
    (on-table b281)
    (clear b235)
    (on-table b235)
    (clear b139)
    (on-table b139)
    (clear b125)
    (on b125 b135)
    (on b135 b209)
    (on b209 b191)
    (on b191 b5)
    (on b5 b30)
    (on b30 b15)
    (on-table b15)
    (clear b210)
    (on b210 b138)
    (on b138 b214)
    (on b214 b87)
    (on b87 b163)
    (on-table b163)
    (clear b248)
    (on-table b248)
    (clear b140)
    (on-table b140)
    (clear b232)
    (on b232 b32)
    (on b32 b229)
    (on-table b229)
    (clear b170)
    (on b170 b259)
    (on b259 b252)
    (on b252 b147)
    (on b147 b173)
    (on b173 b108)
    (on b108 b79)
    (on b79 b161)
    (on-table b161)
    (clear b23)
    (on b23 b261)
    (on b261 b150)
    (on-table b150)
    (clear b16)
    (on b16 b249)
    (on b249 b64)
    (on-table b64)
    (clear b168)
    (on b168 b198)
    (on b198 b100)
    (on-table b100)
    (clear b158)
    (on b158 b117)
    (on b117 b221)
    (on b221 b236)
    (on b236 b145)
    (on b145 b183)
    (on b183 b62)
    (on b62 b120)
    (on b120 b14)
    (on b14 b216)
    (on-table b216)
    (clear b130)
    (on-table b130)
    (clear b192)
    (on b192 b82)
    (on b82 b258)
    (on b258 b266)
    (on b266 b242)
    (on b242 b28)
    (on b28 b63)
    (on b63 b94)
    (on-table b94)
    (clear b53)
    (on-table b53)
    (clear b172)
    (on b172 b222)
    (on b222 b70)
    (on-table b70)
    (clear b9)
    (on-table b9)
    (clear b166)
    (on b166 b48)
    (on-table b48)
    (clear b104)
    (on b104 b246)
    (on-table b246)
    (clear b171)
    (on-table b171)
    (clear b165)
    (on b165 b207)
    (on-table b207)
    (clear b77)
    (on-table b77)
    (clear b91)
    (on-table b91)
    (clear b186)
    (on b186 b129)
    (on b129 b175)
    (on-table b175)
    (clear b278)
    (on b278 b89)
    (on-table b89)
    (clear b241)
    (on b241 b25)
    (on b25 b71)
    (on-table b71)
    (clear b184)
    (on b184 b190)
    (on b190 b47)
    (on b47 b181)
    (on b181 b188)
    (on b188 b180)
    (on b180 b245)
    (on b245 b24)
    (on b24 b97)
    (on-table b97)
    (clear b21)
    (on-table b21))
 (:goal  (and 
    (clear b3)
    (on b3 b7)
    (on b7 b5)
    (on b5 b4)
    (on b4 b2)
    (on b2 b1)
    (on-table b1)
    (clear b8)
    (on b8 b6)
    (on-table b6))))

; plan
1. (unstack b6 b282)
   deleted: (on b6 b282) (clear b6) (arm-empty)
   added: (holding b6) (clear b282)
   goals met: 0 of 10
2. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 1 of 10
3. (unstack b125 b135)
   deleted: (on b125 b135) (clear b125) (arm-empty)
   added: (holding b125) (clear b135)
   goals met: 1 of 10
4. (putdown b125)
   deleted: (holding b125)
   added: (clear b125) (arm-empty) (on-table b125)
   goals met: 1 of 10
5. (unstack b135 b209)
   deleted: (on b135 b209) (clear b135) (arm-empty)
   added: (holding b135) (clear b209)
   goals met: 1 of 10
6. (putdown b135)
   deleted: (holding b135)
   added: (clear b135) (arm-empty) (on-table b135)
   goals met: 1 of 10
7. (unstack b157 b239)
   deleted: (on b157 b239) (clear b157) (arm-empty)
   added: (holding b157) (clear b239)
   goals met: 1 of 10
8. (putdown b157)
   deleted: (holding b157)
   added: (clear b157) (arm-empty) (on-table b157)
   goals met: 1 of 10
9. (unstack b19 b72)
   deleted: (on b19 b72) (clear b19) (arm-empty)
   added: (holding b19) (clear b72)
   goals met: 1 of 10
10. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 1 of 10
11. (unstack b208 b95)
   deleted: (on b208 b95) (clear b208) (arm-empty)
   added: (holding b208) (clear b95)
   goals met: 1 of 10
12. (putdown b208)
   deleted: (holding b208)
   added: (clear b208) (arm-empty) (on-table b208)
   goals met: 1 of 10
13. (unstack b209 b191)
   deleted: (on b209 b191) (clear b209) (arm-empty)
   added: (holding b209) (clear b191)
   goals met: 1 of 10
14. (putdown b209)
   deleted: (holding b209)
   added: (clear b209) (arm-empty) (on-table b209)
   goals met: 1 of 10
15. (unstack b191 b5)
   deleted: (on b191 b5) (clear b191) (arm-empty)
   added: (holding b191) (clear b5)
   goals met: 1 of 10
16. (putdown b191)
   deleted: (holding b191)
   added: (clear b191) (arm-empty) (on-table b191)
   goals met: 1 of 10
17. (unstack b239 b18)
   deleted: (on b239 b18) (clear b239) (arm-empty)
   added: (holding b239) (clear b18)
   goals met: 1 of 10
18. (putdown b239)
   deleted: (holding b239)
   added: (clear b239) (arm-empty) (on-table b239)
   goals met: 1 of 10
19. (unstack b18 b8)
   deleted: (on b18 b8) (clear b18) (arm-empty)
   added: (holding b18) (clear b8)
   goals met: 2 of 10
20. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 2 of 10
21. (unstack b275 b203)
   deleted: (on b275 b203) (clear b275) (arm-empty)
   added: (holding b275) (clear b203)
   goals met: 2 of 10
22. (putdown b275)
   deleted: (holding b275)
   added: (clear b275) (arm-empty) (on-table b275)
   goals met: 2 of 10
23. (unstack b203 b46)
   deleted: (on b203 b46) (clear b203) (arm-empty)
   added: (holding b203) (clear b46)
   goals met: 2 of 10
24. (putdown b203)
   deleted: (holding b203)
   added: (clear b203) (arm-empty) (on-table b203)
   goals met: 2 of 10
25. (unstack b276 b22)
   deleted: (on b276 b22) (clear b276) (arm-empty)
   added: (holding b276) (clear b22)
   goals met: 2 of 10
26. (putdown b276)
   deleted: (holding b276)
   added: (clear b276) (arm-empty) (on-table b276)
   goals met: 2 of 10
27. (unstack b22 b174)
   deleted: (on b22 b174) (clear b22) (arm-empty)
   added: (holding b22) (clear b174)
   goals met: 2 of 10
28. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 2 of 10
29. (unstack b174 b211)
   deleted: (on b174 b211) (clear b174) (arm-empty)
   added: (holding b174) (clear b211)
   goals met: 2 of 10
30. (putdown b174)
   deleted: (holding b174)
   added: (clear b174) (arm-empty) (on-table b174)
   goals met: 2 of 10
31. (unstack b211 b80)
   deleted: (on b211 b80) (clear b211) (arm-empty)
   added: (holding b211) (clear b80)
   goals met: 2 of 10
32. (putdown b211)
   deleted: (holding b211)
   added: (clear b211) (arm-empty) (on-table b211)
   goals met: 2 of 10
33. (unstack b279 b90)
   deleted: (on b279 b90) (clear b279) (arm-empty)
   added: (holding b279) (clear b90)
   goals met: 2 of 10
34. (putdown b279)
   deleted: (holding b279)
   added: (clear b279) (arm-empty) (on-table b279)
   goals met: 2 of 10
35. (unstack b46 b7)
   deleted: (on b46 b7) (clear b46) (arm-empty)
   added: (holding b46) (clear b7)
   goals met: 2 of 10
36. (putdown b46)
   deleted: (holding b46)
   added: (clear b46) (arm-empty) (on-table b46)
   goals met: 2 of 10
37. (unstack b72 b36)
   deleted: (on b72 b36) (clear b72) (arm-empty)
   added: (holding b72) (clear b36)
   goals met: 2 of 10
38. (putdown b72)
   deleted: (holding b72)
   added: (clear b72) (arm-empty) (on-table b72)
   goals met: 2 of 10
39. (unstack b36 b262)
   deleted: (on b36 b262) (clear b36) (arm-empty)
   added: (holding b36) (clear b262)
   goals met: 2 of 10
40. (putdown b36)
   deleted: (holding b36)
   added: (clear b36) (arm-empty) (on-table b36)
   goals met: 2 of 10
41. (unstack b262 b2)
   deleted: (on b262 b2) (clear b262) (arm-empty)
   added: (holding b262) (clear b2)
   goals met: 2 of 10
42. (putdown b262)
   deleted: (holding b262)
   added: (clear b262) (arm-empty) (on-table b262)
   goals met: 2 of 10
43. (unstack b80 b116)
   deleted: (on b80 b116) (clear b80) (arm-empty)
   added: (holding b80) (clear b116)
   goals met: 2 of 10
44. (putdown b80)
   deleted: (holding b80)
   added: (clear b80) (arm-empty) (on-table b80)
   goals met: 2 of 10
45. (unstack b116 b12)
   deleted: (on b116 b12) (clear b116) (arm-empty)
   added: (holding b116) (clear b12)
   goals met: 2 of 10
46. (putdown b116)
   deleted: (holding b116)
   added: (clear b116) (arm-empty) (on-table b116)
   goals met: 2 of 10
47. (unstack b12 b132)
   deleted: (on b12 b132) (clear b12) (arm-empty)
   added: (holding b12) (clear b132)
   goals met: 2 of 10
48. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 2 of 10
49. (unstack b132 b1)
   deleted: (on b132 b1) (clear b132) (arm-empty)
   added: (holding b132) (clear b1)
   goals met: 2 of 10
50. (putdown b132)
   deleted: (holding b132)
   added: (clear b132) (arm-empty) (on-table b132)
   goals met: 2 of 10
51. (unstack b1 b177)
   deleted: (on b1 b177) (clear b1) (arm-empty)
   added: (holding b1) (clear b177)
   goals met: 2 of 10
52. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 3 of 10
53. (unstack b90 b74)
   deleted: (on b90 b74) (clear b90) (arm-empty)
   added: (holding b90) (clear b74)
   goals met: 3 of 10
54. (putdown b90)
   deleted: (holding b90)
   added: (clear b90) (arm-empty) (on-table b90)
   goals met: 3 of 10
55. (unstack b74 b4)
   deleted: (on b74 b4) (clear b74) (arm-empty)
   added: (holding b74) (clear b4)
   goals met: 3 of 10
56. (putdown b74)
   deleted: (holding b74)
   added: (clear b74) (arm-empty) (on-table b74)
   goals met: 3 of 10
57. (unstack b95 b197)
   deleted: (on b95 b197) (clear b95) (arm-empty)
   added: (holding b95) (clear b197)
   goals met: 3 of 10
58. (putdown b95)
   deleted: (holding b95)
   added: (clear b95) (arm-empty) (on-table b95)
   goals met: 3 of 10
59. (unstack b197 b119)
   deleted: (on b197 b119) (clear b197) (arm-empty)
   added: (holding b197) (clear b119)
   goals met: 3 of 10
60. (putdown b197)
   deleted: (holding b197)
   added: (clear b197) (arm-empty) (on-table b197)
   goals met: 3 of 10
61. (unstack b119 b109)
   deleted: (on b119 b109) (clear b119) (arm-empty)
   added: (holding b119) (clear b109)
   goals met: 3 of 10
62. (putdown b119)
   deleted: (holding b119)
   added: (clear b119) (arm-empty) (on-table b119)
   goals met: 3 of 10
63. (unstack b109 b265)
   deleted: (on b109 b265) (clear b109) (arm-empty)
   added: (holding b109) (clear b265)
   goals met: 3 of 10
64. (putdown b109)
   deleted: (holding b109)
   added: (clear b109) (arm-empty) (on-table b109)
   goals met: 3 of 10
65. (unstack b265 b269)
   deleted: (on b265 b269) (clear b265) (arm-empty)
   added: (holding b265) (clear b269)
   goals met: 3 of 10
66. (putdown b265)
   deleted: (holding b265)
   added: (clear b265) (arm-empty) (on-table b265)
   goals met: 3 of 10
67. (unstack b269 b3)
   deleted: (on b269 b3) (clear b269) (arm-empty)
   added: (holding b269) (clear b3)
   goals met: 4 of 10
68. (putdown b269)
   deleted: (holding b269)
   added: (clear b269) (arm-empty) (on-table b269)
   goals met: 4 of 10
69. (unstack b2 b234)
   deleted: (on b2 b234) (clear b2) (arm-empty)
   added: (holding b2) (clear b234)
   goals met: 4 of 10
70. (stack b2 b1)
   deleted: (clear b1) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b1)
   goals met: 5 of 10
71. (unstack b4 b189)
   deleted: (on b4 b189) (clear b4) (arm-empty)
   added: (holding b4) (clear b189)
   goals met: 5 of 10
72. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 6 of 10
73. (unstack b5 b30)
   deleted: (on b5 b30) (clear b5) (arm-empty)
   added: (holding b5) (clear b30)
   goals met: 6 of 10
74. (stack b5 b4)
   deleted: (clear b4) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b4)
   goals met: 7 of 10
75. (unstack b7 b93)
   deleted: (on b7 b93) (clear b7) (arm-empty)
   added: (holding b7) (clear b93)
   goals met: 7 of 10
76. (stack b7 b5)
   deleted: (clear b5) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b5)
   goals met: 8 of 10
77. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 7 of 10
78. (stack b3 b7)
   deleted: (clear b7) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b7)
   goals met: 9 of 10
79. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 8 of 10
80. (stack b8 b6)
   deleted: (clear b6) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b6)
   goals met: 10 of 10
